### CHAPTER 1

In [42]:
msg = "여러분의 합격을 응원합니다"
def repl(s):
    return s.replace("여러분", "당신")

re = repl(msg)
print(re)
print(msg)

당신의 합격을 응원합니다
여러분의 합격을 응원합니다

### CHAPTER 2

In [43]:
import pandas as pd

In [44]:
series = pd.Series(['2', '1', '0'])
series

0    2
1    1
2    0
dtype: object

In [45]:
names = pd.Series(["woo", "seong", "yun"])
names

0      woo
1    seong
2      yun
dtype: object

In [46]:
df = pd.DataFrame({
    "메뉴": ['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격": [4500, 5000, 5500, 5000, 4000, 5900, 5300],
    "칼로리": [10, 110, 250, 110, 20, 210, 0],
})
df.describe(include="O")

           메뉴
count       7
unique      7
top     아메리카노
freq        1

In [47]:
# dataframe 저장하기
df.to_csv("cafe.csv", index=False)

In [48]:
# csv 파일 읽기
temp_df = pd.read_csv("cafe.csv")
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [ ]:
# 범주형 데이터 탐색
df_car = pd.DataFrame({
    "car": ['Sedan', 'SUV', 'Sedan', 'SUV', 'SUV', 'SUV', 'Sedan', 'Sedan', 'Sedan', 'Sedan', 'Sedan'],
    "size": ['S', 'M', 'S', 'S', 'M', 'M', 'L', 'S', 'S', 'M', 'S']
})
#df_car.head()
#df_car.nunique()
#print(df_car['car'].unique())
#print(df_car['car'].value_counts())
df_car.describe(include="O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [ ]:
### 행/열 삭제
df = pd.read_csv('cafe.csv')

#df['할인가'] = df['가격'] * 0.8
# 행 삭제 = drop('index', axis=0, inplace=True or False)
# 열 삭제 = drop('column name', axis=1, inplace=True or False)
print(df.shape)
df.drop('메뉴', axis=1, inplace=True)
print(df.shape)

(7, 3)
(7, 2)

In [ ]:
### 인덱싱/슬라이싱(loc)

df = pd.read_csv('cafe.csv')
#df.loc[:, '메뉴':'가격']
df.drop(0, axis=0, inplace=True)
df.iloc[0, 0:3]

메뉴     카페라떼
가격     5000
칼로리     110
Name: 1, dtype: object

In [123]:
import numpy as np
df = pd.read_csv('cafe.csv')
df['원산지'] = np.nan
df.loc[len(df)] = {
    "메뉴": '코코아',
    "가격": 3000,
    "칼로리": 300,
}
df.loc[len(df)] = ["유자차", 2800, 180, "대한민국"]
df.to_csv("cafe2.csv", index=False)
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10   NaN
1   카페라떼  5000  110   NaN
2   카페모카  5500  250   NaN
3   카푸치노  5000  110   NaN
4  에스프레소  4000   20   NaN
5    밀크티  5900  210   NaN
6     녹차  5300    0   NaN
7    코코아  3000  300   NaN
8    유자차  2800  180  대한민국

In [ ]:
df = pd.read_csv('cafe2.csv')
#df = df.sort_index(ascending=False)
df = df.sort_values(by=['가격', '칼로리'], ascending=True)
df

      메뉴    가격  칼로리   원산지
8    유자차  2800  180  대한민국
7    코코아  3000  300   NaN
4  에스프레소  4000   20   NaN
0  아메리카노  4500   10   NaN
3   카푸치노  5000  110   NaN
1   카페라떼  5000  110   NaN
6     녹차  5300    0   NaN
2   카페모카  5500  250   NaN
5    밀크티  5900  210   NaN